src/test/java/com/bitpay/demo/invoice/application/features/tasks/updateinvoice/updatedInvoice.json

{
  "uuid": {
    "value": "123-456-789"
  },
  "posData": {
    "value": "{\"price\":\"123\",\"reg_transaction_no\":\"123\",\"store\":\"store-2\",\"register\":\"2\"}"
  },
  "price": {
    "value": 125.0
  },
  "currencyCode": {
    "value": "USD"
  },
  "bitPayId": {
    "value": "CoJ3XEVtpekVWXoD781j3K"
  },
  "status": {
    "value": "expired"
  },
  "createdDate": "2023-03-10T11:18:27.831",
  "bitPayOrderId": {
    "value": "2828d335-1a87-424d-9a8f-362c20a09479"
  },
  "expirationTime": "2023-03-08T11:16:03.367",
  "facadeType": {
    "value": "pos/invoice"
  },
  "bitPayGuid": {
    "value": "6ba0b636-4bb4-4650-8c03-b13384265860"
  },
  "exceptionStatus": {
    "value": "false"
  },
  "bitPayUrl": {
    "value": "https://test.bitpay.com/invoice?id\u003dA8Eo7WppQBpQjcgC2mKXqV"
  },
  "redirectUrl": {
    "value": ""
  },
  "closeUrl": {
    "value": ""
  },
  "acceptanceWindow": {
    "value": 0
  },
  "token": {
    "value": "6yqFWN5u7Asbnnan6H59qHDSpp5QuUmAZhzg4s1nFLnyYdZNNKjg7Y4zb4hzv7hpxg"
  },
  "merchantName": {
    "value": "SUMO Heavy Industries LLC"
  },
  "itemDescription": {
    "value": "Example"
  },
  "billId": {
    "value": ""
  },
  "targetConfirmations": {
    "value": 0
  },
  "lowFeeDetected": {
    "value": false
  },
  "autoRedirect": {
    "value": false
  },
  "shopperUser": {
    "value": ""
  },
  "jsonPayProRequired": {
    "value": false
  },
  "bitPayIdRequired": {
    "value": false
  },
  "isCancelled": {
    "value": false
  },
  "transactionSpeed": {
    "value": "medium"
  },
  "invoicePayment": {
    "amountPaid": {
      "value": 0.0
    },
    "paymentCurrencies": []
  },
  "invoiceBuyer": {
    "invoiceBuyerProvidedInfo": {
      "name": {
        "value": ""
      },
      "phoneNumber": {
        "value": ""
      },
      "selectedTransactionCurrency": {
        "value": ""
      },
      "emailAddress": {
        "value": ""
      },
      "selectedWallet": {
        "value": ""
      },
      "sms": {
        "value": ""
      },
      "smsVerified": {
        "value": false
      }
    }
  },
  "invoiceRefund": {
    "addressesJson": {
      "value": ""
    },
    "addressRequestPending": {
      "value": false
    },
    "refundInfo": []
  },
  "invoiceTransactions": [],
  "invoiceItemizedDetails": []
}